In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt
import numpy as np


dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [23]:
df.loc[:, 'salary_rate': 'salary_hour_avg'].dropna(subset='salary_rate')

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [7]:
df.loc[[6338, 88732, 3642, 524282, 73529]].dropna(subset= 'job_title')

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
6338,Data Scientist,ESI 33 Data scientist H/F,"Castres-Gironde, France",via Jobijoba,Full-time,False,France,2023-06-26 13:48:59,False,False,France,None,NaN,NaN,Ac Amiens,"['sas', 'sas', 'java', 'css', 'html', 'javascr...","{'analyst_tools': ['sas'], 'databases': ['post..."
88732,Data Engineer,Engineering Director - Data & Analytics Tribe,"Kuala Lumpur, Federal Territory of Kuala Lumpu...",via Denmark,Full-time,False,Malaysia,2023-10-20 01:09:11,True,False,Malaysia,None,NaN,NaN,SWIFT,"['swift', 'excel']","{'analyst_tools': ['excel'], 'programming': ['..."
3642,Data Engineer,Data Engineer,"Sandy, UT",via Trabajo.org,Full-time,False,Georgia,2023-12-02 13:46:03,False,False,United States,None,NaN,NaN,Insight Global,"['t-sql', 'sql', 'postgresql', 'sql server', '...","{'analyst_tools': ['ssis'], 'databases': ['pos..."
524282,Data Scientist,Marketing Data Scientist,"Shelton, CT",via Trabajo.org,Full-time,False,"New York, United States",2023-09-06 11:01:24,False,False,United States,None,NaN,NaN,Discount School Supply,"['python', 'r']","{'programming': ['python', 'r']}"
73529,Senior Data Engineer,Senior Data Engineer,Anywhere,via Recruit.net,Full-time,True,"Illinois, United States",2023-01-09 00:06:33,False,False,United States,None,NaN,NaN,Engtal,"['python', 'sql', 'go', 'java', 'elasticsearch...","{'cloud': ['databricks', 'aws', 'azure', 'gcp'..."